//
//  questionAnswer.swift
//  HarryPotterFans
//
//  Created by Nikita Kuznetsov on 4/18/23.
//

import Foundation


class QuestionAnswer {
    
    let q1 = "Сколько факультетов в Хогвартсе?"
    let q1a1 = "4"
    let q1a2 = "3"
    let q1a3 = "5"
    let q1a4 = "1"
    
    let q2 = "Сколько Гарии было лет на момент поевой части?"
    let q2a1 = "10"
    let q2a2 = "11"
    let q2a3 = "14"
    let q2a4 = "16"
    
    let q3 = "Настоящее имя Волан-де-Морта?"
    let q3a1 = "Джек"
    let q3a2 = "Гермиона"
    let q3a3 = "Том"
    let q3a4 = "Рейф"

    let q4 = "Какое животное на первом собрании Дуэльного клуба Драко Малфой вызвал заклинанием «Serpensortia»?"
    let q4a1 = "Лягушка"
    let q4a2 = "Змея"
    let q4a3 = "Дракон"
    let q4a4 = "Медведь"
    
    let q5 = "Какое из этих заклинаний является непростительным?"
    let q5a1 = "Бомбардо"
    let q5a2 = "Империус"
    let q5a3 = "Алохомора"
    let q5a4 = "Асцендио"
    
    let q6 = "Заклинание «Фелифорс» превращает кошку во что?"
    let q6a1 = "Гарри Поттера"
    let q6a2 = "Летучую мышь"
    let q6a3 = "Шапку"
    let q6a4 = "Котел"
    
    let q7 = "Безмерное остроумие - величайшее сокровище человека» - вот девиз какого дома?"
    let q7a1 = "Гриффиндор"
    let q7a2 = "Хаффлпафф"
    let q7a3 = "Равенкло"
    let q7a4 = "Слизерин"
    
    let q8 = "Какую позицию занимает Гарри в своей команде по квиддичу?"
    let q8a1 = "Ловец"
    let q8a2 = "Хранитель"
    let q8a3 = "Бладжер"
    let q8a4 = "(-_-)"
    
    let q9 = "Какой крестраж уничтожил Альбус Дамблдор?"
    let q9a1 = "Медальон слизерина"
    let q9a2 = "Нагайной"
    let q9a3 = "Чашка Хаффлпаффа"
    let q9a4 = "Кольцо Марволо  Гаунта"
    
    let q10 = "Закончите надпись на надгробии Добби: «Здесь лежит Добби ..."
    let q10a1 = "Настоящий друг"
    let q10a2 = "Лучший слуга"
    let q10a3 = "Свободный эльф"
    let q10a4 = "Мастер носков"
}

